/*
두 개의 정수 A와 B가 주어졌을 때, A Modulo B는 A를 B로 나누었을 때의 나머지를 의미한다. 예를 들어서 7, 14, 27, 38을 3으로 나누었을 때의 나머지는 1, 2, 0, 2가 된다. 10개의 정수가 주어지면, 42로 나누었을 때, 서로 다른 나머지를 갖는 수는 몇 개나 되는지 구하여라.

입력형식
1,000보다 작은 음이 아닌 정수가 10개의 줄에 걸쳐서 각 줄에 주어진다.

출력형식
입력으로 주어진 정수들을 42로 나누었을 때, 서로 다른 나머지를 갖는 정수는 몇 개나 되는지 출력의 첫째 줄에 출력하여라.

입력과 출력의 예(1)
입력
1
2
3
4
5
6
7
8
9
10

출력
10

입력과 출력의 예(2)
입력
42
84
252
420
840
126
42
84
420
126

출력
1

참고
첫 번째 입력과 출력의 예는 42로 나누었을 때, 서로 다른 나머지 1, 2, 3, 4, 5, 6, 7, 8, 9, 10을 갖는다. 두 번째 입력과 출력의 예는 42로 나누었을 때, 오직 나머지 0을 갖는다.
*/

#include <stdio.h>

int main(void) {
  int rest[10][2], ratio[10], i, j;

  /*
   * Not ready to submit.
   */
}
