/*
체스판의 말들이 부족하여 더 이상 체스를 둘 수 없었던 오일러는 페르마의 집에 달려가서 다락방에 있던 예전의 말들을 찾아내었다. 놀랍게도 페르마의 다락방에 있던 체스판의 말들은 모두 검정색이었다. 더 이상 체스를 둘 수 없었던 그들은 체스판을 자르기로 결심하였다.

숙련된 나무 절단 전문가인 오일러는 최대한 많은 조각으로 절단하려고 한다. 오일러는 최대 N번의 자르기로, 체스판의 가장자리에서 오직 수평으로 자르거나 수직으로만 잘라야 한다. (체스판의 가장자리와 평행하게)

입력형식
첫째 줄에는 오일러가 체스판을 자른 횟수인 한 개의 정수 N(1≤N≤100)이 주어진다.

출력형식
N번의 절단으로 체스판을 자르고 나서 오일러가 얻을 수 있는 최대 조각의 수를 첫째 줄에 출력하여라.

입력과 출력의 예(1)
입력
1

출력
2

입력과 출력의 예(2)
입력
3

출력
6
*/

#include <stdio.h>

int main(void) {
  int realized, ...;
  // Not ready

  int x, y, z;
  scanf("%d %d %d", &x, &y, &z);
}
